# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_WaveletBlock, [128]]  # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_WaveletBlock, [256]]  # 4-P3/8
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 2, C2f_SKATBlock, [384]]  # 6-P4/16
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_SKATBlock, [384]]  # 8-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [[2, 4, 6, 8], 1, SimFusion_4in, []] # 12
  - [-1, 1, IFM, [[64, 32]]] # 13

  - [11, 1, Conv, [256, 1, 1]] # 14
  - [[4, 6, -1], 1, SimFusion_3in, [256]] # 15
  - [[-1, 13], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]] # 16
  - [-1, 3, RepC3, [256, 0.5]] # 17

  - [6, 1, Conv, [256, 1, 1]] # 18
  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 19
  - [[-1, 13], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 20
  - [-1, 3, RepC3, [256, 0.5]] # 21

  - [[21, 17, 11], 1, PyramidPoolAgg, [352, 2]] # 22
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 23

  - [[21, 18], 1, AdvPoolFusion, []] # 24
  - [[-1, 23], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 25
  - [-1, 3, RepC3, [256, 0.5]] # 26

  - [[-1, 14], 1, AdvPoolFusion, []] # 27
  - [[-1, 23], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 1]] # 28
  - [-1, 3, RepC3, [256, 0.5]] # 29

  - [[4, 6, 9], 1, ScalSeq, [256]] # 30
  # - [[20, -1], 1, Add, []] # 31
  - [[21, -1], 1, asf_attention_model, []] # 31

  - [[31, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 32