# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
fusion_mode: bifpn
# node_mode: CSP_MSCB_SC
head_channel: 256

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_WaveletBlock, [128]]  # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_WaveletBlock, [256]]  # 4-P3/8
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 2, C2f_SKATBlock, [384]]  # 6-P4/16
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_SKATBlock, [384]]  # 8-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [4, 1, Conv, [head_channel]]  # 12-P3/8
  - [6, 1, Conv, [head_channel]]  # 13-P4/16
  - [11, 1, Conv, [head_channel]]  # 14-P5/32

  - [13, 1, Conv, [head_channel, 3, 2]] # 15-P5/32
  - [[-1, 14], 1, Fusion, [fusion_mode]] # 16
  - [-1, 3, CSP_MSCB_SC, [head_channel, [5,7,9]]] # 17-P5/32

  - [-1, 1, EUCB_SC, []] # 18-P4/16
  - [12, 1, Conv, [head_channel, 3, 2]] # 19-P4/16
  - [[-1, -2, 13], 1, Fusion, [fusion_mode]] # 20
  - [-1, 3, CSP_MSCB_SC, [head_channel, [3,5,7]]] # 21-P4/16

  - [-1, 1, EUCB_SC, []] # 22-P3/8
  - [2, 1, Conv, [head_channel, 3, 2]] # 23-P3/8
  - [[-1, -2, 12], 1, Fusion, [fusion_mode]] # 24
  - [-1, 3, CSP_MSCB_SC, [head_channel, [1,3,5]]] # 25-P3/8

  - [[22, -1], 1, Fusion, [fusion_mode]] # 26
  - [-1, 3, CSP_MSCB_SC, [head_channel, [1,3,5]]] # 27-P3/8

  - [25, 1, Conv, [head_channel, 3, 2]] # 28-P4/16
  - [27, 1, Conv, [head_channel, 3, 2]] # 29-P4/16
  - [[-1, -2, 21, 18], 1, Fusion, [fusion_mode]] # 30-P4/16
  - [-1, 3, CSP_MSCB_SC, [head_channel, [3,5,7]]] # 31-P4/16

  - [21, 1, Conv, [head_channel, 3, 2]] # 32-P5/32
  - [31, 1, Conv, [head_channel, 3, 2]] # 33-P5/32
  - [[-1, -2, 17], 1, Fusion, [fusion_mode]] # 34-P5/32
  - [-1, 3, CSP_MSCB_SC, [head_channel, [5,7,9]]] # 35-P5/32

  - [[27, 31, 35], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)