# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_WaveletBlock, [128]]  # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 3, C2f_WaveletBlock, [256]]  # 4-P3/8
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_SKATBlock, [256]]  # 6-P4/16
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 9, C2f_SKATBlock, [512]]  # 8-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, TransformerEncoderLayer_MSMHSA, [1024]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [-1, 1, CA_HSFPN, []] # 12
  - [-1, 1, nn.Conv2d, [256, 1]] # 13
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 14

  - [6, 1, CA_HSFPN, []] # 15
  - [-1, 1, nn.Conv2d, [256, 1]] # 16
  - [14, 1, CA_HSFPN, [4, False]] # 17
  - [[-1, -2], 1, Multiply, []] # 18
  - [[-1, 14], 1, Add, []] # 19
  - [-1, 3, RepC3, [256, 0.5]] # 20 P4/16

  - [14, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1, 16]] # 21
  - [4, 1, CA_HSFPN, []] # 22
  - [-1, 1, nn.Conv2d, [256, 1]] # 23
  - [21, 1, CA_HSFPN, [4, False]] # 24
  - [[-1, -2], 1, Multiply, []] # 25
  - [[-1, 21], 1, Add, []] # 26
  - [-1, 3, RepC3, [256, 0.5]] # 27 P3/8

  - [-1, 1, nn.Conv2d, [256, 3, 2, 1]] # 28
  - [20, 1, CA_HSFPN, []] # 29
  - [-1, 1, nn.Conv2d, [256, 1]] # 30
  - [28, 1, CA_HSFPN, [4, False]] # 31
  - [[-1, -2], 1, Multiply, []] # 32
  - [[-1, 28], 1, Add, []] # 33
  - [-1, 3, RepC3, [256, 0.5]] # 34 P4/16

  - [28, 1, nn.Conv2d, [256, 3, 2, 1]] # 35
  - [13, 1, CA_HSFPN, []] # 36
  - [-1, 1, nn.Conv2d, [256, 1]] # 37
  - [35, 1, CA_HSFPN, [4, False]] # 38
  - [[-1, -2], 1, Multiply, []] # 39
  - [[-1, 35], 1, Add, []] # 40
  - [-1, 3, RepC3, [256, 0.5]] # 41 P5/32

  - [[27, 34, 41], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6]]  # Detect(P3, P4, P5)
